/**
 * @mainpage
 * # Загальне завдання
 * 1. **Сформувати** функцию, що визначає ідеальним чи є число. Ідеальним є число, коли
 * всі його дільники в сумі дорівнюють цьому число.
 *
 *
 * @author Zakusilov N.
 * @date 21-dec-2020
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи функції, що рахує суму дільників.Та порівнює з самим числом
 *
 * @author Zakusilov N.
 * @date 21-des-2020
 */

#include <stdbool.h>

int summary(number);
/**
 * Головна функція.
 *
 * Послідовність дій:
 * - Оголошення змінних.
 * - Знаходження суми дільників через функцію summary.
 * - Порівняння суми з числом.
 * @param num - задане число
 * @param sum - сума дільників
 * @param flag - булеве значення результату
 * @return успішний код повернення з програми (0)
 */


int main(){
  	int num = 5;
  	int sum = 0;
	bool flag = false;
	sum = summary(num);
	if (num == sum) {
		flag = true;
	}
return 0;
}

/**
 * Визначення суми дільників заданого числа.
 *
 * Функція перевіряє чи є число дільником заданого, та додає його до суми.
 */

int summary(number) {
	int sum = 0;
	for(int i = 1; i <= number / 2; i++){
        	if (number % i == 0){
            	sum += i;
		}
	}
return sum;
}
