/**
 * @mainpage
 * # Загальне завдання
 * 1. **Сформувати** функцию, що буде централізувати рядок, тобто с отриманої строки розташувати текст посередині.
 *
 *
 * @author Zakusilov N.
 * @date 21-dec-2020
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи функції, що централізує рядок.
 *
 * @author Zakusilov N.
 * @date 21-des-2020
 */

void centre(char array[], char arr_res[], int size);

/**
 * Головна функція.
 *
 * Послідовність дій:
 * - Оголошення масиву з рядком.
 * - Заповнюємо рядок заданим символом, у завданні "_"
 * - Централізуємо рядок за допомогою функції centre
 * @param SIZE - константна величина, розмір масиву
 * @param word - заданий рядок
 * @return успішний код повернення з програми (0)
 */

int main(){

	#define SIZE 15

	char word[SIZE] = {'I', 'v', 'a', 'n', 'o', 'v', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '\0'};
	char result[SIZE];

	for (int i = 0; i < SIZE; i++)
		result[i] = '_';
	centre(word, result, SIZE);
}

/**
 * Централізування рядка.
 *
 * Функція спочатку шукає довжину слова, тобто усі символи до пропуска. Після цього, віднявши розмір від довжини слова та поділивши
 * це значення на 2 ми отримали потрібний нам пропуск від початку рядка. Заповнюємо з середини масив результату.
 */

void centre(char array[], char arr_res[], int size){

	int b = 0;
	int lenght = 0;

	for (int i = 0; i < size; i++){
		if (array[i] == ' '){
			lenght = i;
			break;
		}
	}

	for (int j = (size - lenght) / 2; j < lenght + ((size - lenght) / 2); j++) {
		arr_res[j] = array[b];
		b++;
	}
}
