//Змінити  значення  змінних k, m, n, щоб виконувалась нерівність k < m < n
int main()
{
	int k = 3;
	int m = 2;
	int n = 1;
	int add; //Окрім тих змінних, які ми використовуємо нам потрібна додаткова, яка буде в ролі реєстру флага
	/* Ми перевіряємо значення двох змінних (k, m), або (k, n), а потом перевіряємо (m, n)
	якщо значення не буде співпадати з умової ми, за допомогою додаткової змінної, міняємо змінні */
	if  (k >= m) {
		add = k;
		k = m;
		m = add;
	} else if (k >= n) {
			add = k;
			k = n;
			n = add;
		}
	if (m >= n) {
		add = m;
		m = n;
		n = add;
	}
	if (k >= m) {
		add = k;
		k = m;
		m = add;
	}

return 0;
}
